experiments/archive/05-nsys-hardware-profiling-matrix/profiling-results/pass1-default-concurrency64-gpumetrics-1khz-short/bench-result.txt
vllm bench serve --max-concurrency 64 --num-prompts 150 --request-rate inf

============ Serving Benchmark Result ============
Successful requests:                     150
Failed requests:                         0
Maximum request concurrency:             64
Benchmark duration (s):                  28.86
Total input tokens:                      46258
Total generated tokens:                  19200
Request throughput (req/s):              5.20
Output token throughput (tok/s):         665.18
Peak output token throughput (tok/s):    1216.00
Peak concurrent requests:                90.00
Total token throughput (tok/s):          2267.78
---------------Time to First Token----------------
Mean TTFT (ms):                          2230.41
Median TTFT (ms):                        1647.96
P99 TTFT (ms):                           5490.62
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          68.32
Median TPOT (ms):                        72.11
P99 TPOT (ms):                           80.19
---------------Inter-token Latency----------------
Mean ITL (ms):                           67.91
Median ITL (ms):                         53.66
P99 ITL (ms):                            418.62
==================================================